# Python:

# 1. შეინახეთ სამი ქალაქის სახელი ცალკე ცვლადში და დაპრინტეთ ისინი.

# 2. შეართეთ ორი სიტყვა (მაგ., სახელი და გვარი) და დაპრინტეთ სრული სახელი.

# 3. აიღეთ ორი რიცხვი და დაპრინტეთ მათი ჯამი, სხვაობა, ნამრავლი და განაყოფი.

# 4. მიანიჭეთ ერთი ცვლადის მნიშვნელობა მეორეს და დაპრინტეთ ორივე ცვლადი, რომ ნახოთ შედეგი.

# 5. შემოატანინეთ მომხმარებელს მისი საყვარელი ფერი და დაპრინტეთ წინადადება, რომელშიც ეწერება ეს ფერი.

# 6. შეინახეთ სტრინგი, მთელი რიცხვი და float სამ განსხვავებულ ცვლადში და დაპრინტეთ მათი ტიპები.

# 7. აიღეთ float რიცხვი, გადააკეთეთ იგი მთელ რიცხვად და შემდეგ დაპრინტეთ როგორც ორიგინალური float, ასევე გადაყვანილი მთელი რიცხვად.

# 8. შეინახეთ რიცხვი ცვლადში და შეამოწმეთ მისი მონაცემთა ტიპი `type()` ფუნქციით. დაპრინტეთ შედეგი.

# 9. ორ რიცხვზე შეასრულეთ  არითმეტიკული მოქმედებები (შეკრება, გამოკლება, გამრავლება, გაყოფა) და შედეგები შეინახეთ ცვლადებში. შედეგების დაპრინტეთ.

# 10. აიღეთ სამი სტრინგი და გააერთიანეთ ისინი ერთ წინადადებად. დაბეჭდეთ საბოლოო წინადადება.
#    აქ არის კიდევ 6 დავალება, რომლებიც ფოკუსირებულია შედარების ოპერატორებზე პირობითების გამოყენების გარეშე:

# 11. შეინახეთ ორი რიცხვი ცალკეულ ცვლადებში და გამოიყენეთ შედარების ოპერატორები (`<`, `>`, `<=`, `>=`, `==`, `!=`) შედარებისთვის. დაპრინტეთ თითოეული შედარების შედეგი.

# 12. შექმენით ცვლადები ორი სხვადასხვა ასაკისათვის. გამოიყენეთ შედარების ოპერატორები იმის შესამოწმებლად, არის თუ არა ერთი ასაკი მეორეზე დიდი ან მისი ტოლი. დაპრინტეთ შედეგი.

# 13. სამ ცვლადს მიანიჭეტ რიცხვითი მნიშვნელობები. გამოიყენეთ შედარების ოპერატორები, რათა შეამოწმოთ არის თუ არა პირველი ცვლადი მეორეზე ნაკლები და თუ მეორე მესამეზე ნაკლები. დაპრინტეთ შედეგები.

# 14. ცვლადში შეინახეთ ორი სხვადასხვა სტრინგი და შეადარეთ ისინი ტოლობის (`==`) და უტოლობა (`!=`) ოპერატორების გამოყენებით. დაპრინტეთ ამ შედარების შედეგები.

#1
city = "tbilisi"
city_1 = "batumi"
city_2 = "london"

print(f"{city} {city_1} {city_2}")
#2
name = "achi"
last_name = "utrugashvili"

print(f"{name} {last_name}")
#3
age = 145
hight = 100
print (age + hight)
print (age - hight)
print (age * hight)
print (age / hight)
#4
idk = "hello"
idk_1 = "world"

print (f"{idk} {idk_1}")
#5
color = input("enter your favorite color")

print (f"your favorite color is {color}")
#6

chad = "achi"
year = 2024
money = 45.3

print (type(chad))
print (type(year))
print (type(money))
#7
pool =int(10.4) 
print (pool)

#8
bob = 45

print (type(bob))

#9
solo = 34
duo = 45
print (solo + duo)
print (solo - duo)
print (solo * duo)
print (solo / duo)

#10
chandler = "im"
jimmy = "a"
max = "mini leader"

print (f"{chandler} {jimmy} {max}")
#11
idk_4 = 4
idk_5 = 6

print (idk_4 < idk_5)
print (idk_4 < idk_5)
print (idk_4 <= idk_5)
print (idk_4 >= idk_5)
print (idk_4 == idk_5)
print (idk_4 != idk_5)
#12
ena = 14 
deda = 16
print (ena < deda)
print (ena > deda)
print (ena == deda)
#13
dog = 15
cat = 20
pig = 27
print (dog < cat < pig)
#14
laptop ="cool","cooler"

print ("cool"=="cooler" )
print ("cool" != "cooler")