# 1. სიაში შეინახეთ 5 რიცხვი, შემდეგ კი დარპინტეთ პირველი და მეოთხე ელემენტების ნამრავლი.
# 2. სიაში შეინახეთ 7 სტრინგი, შემდეგ დაპრინტეთ შუა სტრინგი.
# 3. ცვლადში შეინახეთ სტრინგი, შემდეგ კი დაპრინტეთ ამ სტრინგის მხოლოდ მეორე ასო.
# 4. ცვლადში შეინახეთ სტრინგი, შემდეგ კი დაპრინტეთ ამ სტრინგის მეორე და მესამე ასო.

# Bonus:

# * შექმენით ვენდინგ მანქანის თამაში პითონის მეშვეობით, როგორც გაკვეთილზე გავაკეთე, უნდა გქონდეთ პროდუქტები, მომხმარებელს უნდა შეეძლოს არჩევა რიცხვის მიხედვით, შემდეგ კი უნდა დაუპრინტოს ის პროდუქტი, რომელიც ამოირჩია, პროდუქტები შეინახეთ სიაში.

#1 

name=[ 5 , 67 , 54 , 433 , 77]

print(name[0])
print(name[3])


#2

idk=["achi","nini","dachi","gio","mariami","soso","nugzari"]
print(idk[3])

#3

age='nothing'
print(age[1])

#4

donky='solo'
print(donky[1])

#5

food=['kinkali','xawapuri','lobiani','pizza']
print(int(food["kinkali-0 , xawapuri-1 , lobiani-2 , pizza-3"]))