# 1. დაწერეთ პროგრამა, რომელიც ამოწმებს, არის თუ არა რიცხვი დადებითი, უარყოფითი ან ნული და შესაბამისად დაპრინტეთ შეტყობინება.
# 2. შექმენით პროგრამა, რომელიც ატანინებს მომხმარებლის ასაკს და განსაზღვრავს, აქვს თუ არა მას ხმის მიცემის უფლება (18 წლის და მეტი).
# 3. სთხოვეთ მომხმარებელს შემოიტანოს მისი შეფასება (0-100) და დაპრინტეთ, ჩააბარა თუ არა მოსწავლემ (>= 50) ჩააბარა, თუ(< 50) ვერ.
# 4. მომხმარებელს შემოატანინეთ რიცხვი, თუ ეს რიცხვი იქნება 10-ზე ნაკლები, დაუპრინტეთ რომ შემოიტანოს უფრო დიდი რიცხვი, თუ იქნება 10-ზე მეტი, დაუპრინტეთ რომ დავალება შეასრულა.
# 5. დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს ორი რიცხვი და ამოწმებს რომელია უფრო დიდი, ან ტოლია თუ არა ისინი.

#1

idk = int(input("შეიყვანეტ რიცხვი :"))
if idk > 0 :
    print(" შენი შეყვანილი რიცხი არის დადებითი")
elif idk < 0 :
    print("შენიშეყვანილი რიცხვი არის უარყოფითი")
else :
    print("შენი შეყვანილი რიცხვი არის 0")

#2

age = int(input("შიყვანეთ თქვენი ასაკი:"))

if age >= 18 :
    print("შენ გაქვს ხმის მიცემის უფლება")
elif age < 18 :
    print("შენ არ შეგიძლია ხმის მიცემა")
else :
    print("რიცხი შეიყვანე.")

#3

idk_=int(input("შეიყვანე გამოვდის პასუხეი"))

if idk_ >= 50 :
    print("შენ ჩააბარე ეს გამოცდა")
elif idk_ < 50 :
    print("შენ ვერ ჩააბარე ეს გამოცდა")

#4

idk__ = int(input("ჩაწერე რამე რიცხვი :"))

if idk__ < 10 :
    print("ცაწერე ატზე მაღალი რიცხვი")
    idk__ = int(input("ჩაწერე რამე რიცხვი :"))
elif idk__ > 10 :
    print("შენ ეს დავალება სწორეთ გააკეთე")

#5
soso = input("შეივანე რიცხვი 1 :")
nono = input("შეიყვანე  რიცხვი 2:")

if soso > nono :
    print("პირველი შეყვანილი რიცხვი მეტია მეორეზე")
elif nono > soso:
    print("მეორეთ შეყვანილი რიცხვი მეტია მეორეზე")
elif nono == soso :
    print("ორივე რიცხვი ტოლია")
else :
    print("რაღაც არასწორით შეიყვანე.")