# 1. შექმენი პროგრამა, სადაც მომხმარებელს შემოატანინებ თავის, შემდეგ კი მეგობრის  ასაკს, თუ მეგობრის ასაკი მეტია მის ასაკზე, დაუპრინტე რომ პატარაა, თუ მისი ასაკი მეტია მეგობრის ასაკზე, დაუპრინტე რომ დიდია.

# 2. შექმენი პროგრამა, სადაც მომხმარებელს შემოატანინებ მის დაბადების წელს, თუ ის იქნება 2010 წელზე მეტი, დაუპრინტე, რომ gen alpha თაობის წარმომადგენელია, სხვა შემთხვევაში არაფერი არ დაუპრინტო.

# 3. შექმენი პროგრამა, სადაც მომხმარებელს შემოატანინებ მის ასაკს, თუ მისი ასაკი მეტია 10-ზე, დაუპრინტე რამდენი წლის იქნება 15 წლის შემდეგ, თუ მისი ასაკი ნაკლებია 10-ზე დაუპრინტე რამდენი წლის იყო 5 წლის წინ.

# 4. შექმენი პროგრამა, სადაც მომხმარებელს შეეკითხები რამდენი წლით უნდა დროში წინ მოგზაურობა, შემდეგ შემოატანინე მისი დაბადების თარიღი, და დაუპრინტე რამდენი რომელი წელი იქნება, როდესაც მომავალში მისი სასურველი წლით გადავა.

# 5. კომენტარების მეშვეობით ახსენი, რა არის for loop, რა არის while loop, რა განსხვავებაა მათ შორის და რა დროს რომლის გამოყენება სჯობს.

#1

frend_1= int(input("enter your age"))

frend_2= int(input("enter your frends age"))

if frend_1 < frend_2:
    print (" your young")

elif frend_2 < frend_1:
    print("yur frend is young")

else :
    print("you and your frends ar ecual")


#2

age = int(input("enter your buerth year"))

if age > 2010:
    print("your gen alpha")

#3

age = int(input("enter your age"))

if age > 10 :
    print( age + 15)

elif age < 10  :
    print ( age - 5)

#4

age = int(input(" რამდენი წლით გინდა  დროში წინ მოგზაურობა ?"))

idk = int(input("დაწერე შენი დაბადების თარიღი"))

print(age + idk)


#5


#for loop ჩვეულებრივ გამოიყენება, როცა იცით რამდენჯერ უნდა შესრულდეს ციკლი

#while loop გამოიყენება, როცა გსურთ რომ ციკლი გაიმეოროს  სანამ გარკვეული პირობები არ დამაკმაყოფილდება